# Arithmetic expression interpreter -- v2

This version supports operators and functions with different arities. For example:

```
> (/ 10 2)
5
> (abs -3)
3
> (odd 5)
1
> (? 1 2 3)
2
> (? 0 2 3)
3
``` 
